# Taps
tap 'caskroom/cask'
tap 'jesseduffield/lazygit'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bash-completion' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'tig'
brew 'lazygit'
brew 'gist'
brew 'grep'
brew 'mtr'
brew 'nmap'
brew 'tree'
brew 'pstree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'packer'
brew 'pinentry'
brew 'pinentry-mac'
brew 'python'
brew 'pypy'
brew 'pypy3'
brew 'fzf'
brew 'watch'
brew 'grv'
brew 'grc'
brew 'go'
brew 'gnupg'
brew 'gnutls'
brew 'diff-so-fancy'
brew 'colordiff'
brew 'docker-compose'
brew 'kubernetes-cli'
brew 'kops'
brew 'jq'
brew 'httpie'
brew 'curl'
brew 'htop'
brew 'rbenv'
brew 'rbenv-chefdk'
brew 'terraform'
brew 'terraform_landscape'
brew 'vim'
brew 'tmux'
brew 'wget'
brew 'rsync'
brew 'youtube-dl'
brew 'xz'
brew 'unrar'
brew 'telnet'
brew 'tcping'
brew 'ssh-copy-id'
brew 'topgrage'

# Apps
cask 'virtualbox'
cask 'wireshark'
cask 'virtualbox-extension-pack'
cask 'keepassx'
cask 'vagrant'
cask 'gpg-suite'
cask 'keybase'
cask 'alfred'