# Taps
tap 'caskroom/cask'
tap 'jesseduffield/lazygit'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bash-completion' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'tig'
brew 'lazygit'
brew 'gist'
brew 'grep'
brew 'mas'
brew 'mtr'
brew 'nmap'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree'
brew 'pstree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'packer'
brew 'pinentry'
brew 'pinentry-mac'
brew 'python'
brew 'pypy'
brew 'pypy3'
brew 'fzf'
brew 'watch'
brew 'grv'
brew 'grc'
brew 'go'
brew 'gnupg'
brew 'gnutls'
brew 'diff-so-fancy'
brew 'colordiff'
brew 'docker-compose'
brew 'kubernetes-cli'
brew 'kops'
brew 'jq'
brew 'httpie'
brew 'curl'
brew 'htop'
brew 'rbenv'
brew 'rbenv-chefdk'
brew 'terraform'
brew 'terraform_landscape'
brew 'vim'
brew 'tmux'
brew 'wget'
brew 'rsync'
brew 'youtube-dl'
brew 'xz'
brew 'unrar'
brew 'telnet'
brew 'tcping'
brew 'ssh-copy-id'
brew 'topgrage'

# Apps
cask '1password-cli'
cask 'goland'
cask 'iterm2-beta'
cask 'little-snitch'
cask 'skype-preview'
cask 'virtualbox'
cask 'wireshark'
cask 'bartender'
cask 'google-chrome-beta'
cask 'java'
cask 'postman'
cask 'sublime-merge'
cask 'virtualbox-extension-pack'
cask 'docker-edge'
cask 'google-drive-file-stream'
cask 'keepassx'
cask 'pycharm-ce'
cask 'vagrant'
cask 'visual-studio-code'
cask 'firefox-beta'
cask 'gpg-suite'
cask 'keybase'
cask 'rubymine'
cask 'viber'
cask 'vlc'
cask 'alfred'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'The Unarchiver', id: 425424353
mas 'Telegram', id: 747648890
mas 'Omnifocus-3', id: 1346203938
mas 'Reeder-3', id: 880001334
mas 'Pixelmator', id: 407963104
